{
  "RUN_NAME": "Gives a name to the model run, which will be used when generating various output files.",
  "TIMESED": "Has to be used whenever the full partial equilibrium features of TIMES (that is, employing elastic demands) are to be utilized",
  "MACRO": "The general equilibrium mode of TIMES can be activated in two different ways, using the following MACRO control switch settings: YES – activate the standard MACRO formulation, MSA – activate the MACRO decomposition formulation, MLF – activate the linearized MACRO-MLF formulation",
  "OBJ": "ALT Uses modified capacity transfer coefficients that improve the independency of investment costs on period definitions. AUTO (default) TIMES auto­matically selects the objective function among the standard formulation or the ‘MOD’ alternative formulation according to the B(t) and E(t) parameters speci­fied by the user. If those parameters comply with the assumptions used in the standard formulation, then the standard formulation is used, but if not then the alternative formulation ‘MOD’ is used. LIN Assumes linear evolution of flows and activities between Milestone years, but is otherwise similar to the ALT formulation. MOD Period boundaries B(t) and E(t) are internally set to be halfway between Milestone years, giving flexibility to set Milestone years to be other than the middle of each period. Investments in Cases I.1.a and I.1.b only of the objective function investment decision are spread somewhat differently across years. STD To ensure that the standard formulation is unconditionally used, even if the B(t) and E(t) parameters do not comply with the standard assumptions.",
  "DAMAGE": "The TIMES model generator supports the inclusion of so-called damage costs in the objective function. By default, if such damage costs have been defined in the model input data, they are also automatically included in the objective function in linearized form (LP). However, if the user wishes the damage costs to be included in the solution reporting only, the DAMAGE control variable can be set to ‘NO’. Non-linear damage functions can be requested by setting the control variable to ‘NLP’. See Part II, Appendix B, for more on the damage cost function extension.",
  "OBJANN": "Used for requesting a period-wise objective formulation, which can be used e.g. together with the MACRO decomposition method for enabling the iterative update of the period-wise discount factors (See the documentation titled Macro MSA, on the MACRO Decomposition Algorithm, for details).",
  "OBLONG": "In the STD (standard) and MOD (alternative) objective function formulations discussed in Table 2 the capacity-related costs are not completely synchronized with the corresponding activities, which may cause distortions in the accounting of costs. This switch causes all capacity-related cost to be synchronized with the process activities (which are assumed to have oblong shapes), thereby eliminating also the small problems in salvaging that exist in the STD and MOD formulations.",
  "MID_YEAR": "In the standard objective formulation, both the investment payments and the operating cost payments are assumed to occur at the beginning of each year within the economic/technical lifetime of technologies. This also means that the so-called annuities of investment costs are calculated using the following formula, where r is the discount rate (see Part II, Section 6.2 for more on the objective function): CRF = (1–(1+r)^–1^)/(1–(1+r)^–L^). According to this formula, the interest costs are zero if the lifetime L of the technology is only one year because the payments are assumed to occur at the beginning of each year. This approach is often called beginning-of-year discounting. However, it leads to an underestimation of the costs because in reality, the investments can be paid back only after getting some income from the investment. To avoid such underestimation, the following formula for annuities is perhaps more commonly used: CRF = r/(1–(1+r)^–L^). This second formula effectively assumes that the annual investment payments occur at the end of each year. This approach is often called end-of-year discounting. As a good compromise between these two approaches, and highly recommended by many guidelines on good practices in cost evaluations, so-called mid-year discounting can additionally be used.",
  "DISCSHIFT": "As a generalization to the MID_YEAR setting, alternate time-of-year discounting, including the end-of-year discounting mentioned above, can be achieved by using the DISCSHIFT control variable. The control variable should be set to correspond to the amount of time (in years) by which the discounting of continuous streams of payments should be shifted forward in time, with respect to the beginning of operation. Setting it to the value of 0.5 would be equal to the setting MID_YEAR YES, and setting it to the value of 1.0 would be equal to end-of-year discounting, as follows: DISCSHIFT 1.",
  "VARCOST": "The standard dense interpolation and extrapolation of all cost parameters in TIMES may consume considerable amounts of memory resources in very large models. In particular, the variable costs, which may also be to a large extent levelized onto a number of timeslices, usually account for the largest amount of cost data in the GAMS working memory. If desired, TIMES can be advised to interpolate and extrapolate the variable cost parameters only sparsely for the Milestone years. The values at the intermediate years will then be derived “on the fly” by piecewise linear interpolation and will not be stored in the GAMS memory. This option may thus be useful when running very large models on computers with limited memory.",
  "STAGES": "The stochastic mode of TIMES can be activated with the STAGES control variable. This setting is required for using the multi-stage stochastic programming features of TIMES. It can also be used for enabling sensitivity and tradeoff analysis features.",
  "SENSIS": "Many useful sensitivity and tradeoff analysis features are available in TIMES, and they can be enables by activating the stochastic mode of TIMES. However, such sensitivity and tradeoff analyses are often based on running the model in a series of cases that differ from each other in only in a few parameter values. In such cases the so-called warm start features can usually significantly speed up the model solution in the successive runs. The use of the warm start facilities can be automatically enabled in sensitivity and tradeoff analysis by using SEBSIS YES. As the variables then remain the same, warm start is automatically enabled by GAMS according to the BRATIO value.",
  "SPINES": "For modeling recurring uncertainties, such as hydrological conditions or fuel-price volatilities, the stochastic mode can be activated also in such a way that the SOW index will be inactive for all capacity-related variables (VAR_NCAP, VAR_CAP, VAR_RCAP, VAR_SCAP, VAR_DRCAP, VAR_DNCAP). This modification to the standard multi-stage stochastic formulation makes it possible to use the stochastic mode for hedging against recurring uncertainties, and for finding the corresponding optimal investment strategy. This variant of the stochastic mode can be activated by using the following control variable setting: SPINES YES. In addition, under the SPINES option, all the remaining equations that define dynamic or cumulative relationships between variables can additionally be requested to be based on the expected values instead of imposing the inter-period equations separately for each SOW. Doing so will ensure that the uncertainties represented by the SOW-indexed variables will be independent in successive periods. This further model simplification can be requested by using the SOLVEDA switch, as follows: SOLVEDA 1. In addition, under the SPINES option, this SOLVEDA setting will, for now, also cause all the results for the activities and flows to be reported on the basis of the expected values only and not separately for each SOW. After all, the recurring uncertainties are rather aleatory by nature, and therefore the user should probably be most interested in the optimal investment strategy, and only in the average or normal year results for the activities and flows. If requested, an option to produce results for all SOWs even under the period-independent variant can later be added.",
  "FIXBOH": "The FIXBOH option binds the initial years of a model run to values from a previous optimization, requiring a reference case run. Using FIXBOH with the LPOINT control sets fixed bounds for subsequent runs based on solution values from the reference case up to the last Milestone year specified by FIXBOH, which must be used with LPOINT in the form: FIXBOH 2050 LPOINT <run_name> Here, FIXBOH (2050) specifies the year up to which the model solution is fixed, and LPOINT (run_name) specifies the previous run's name for retrieving the solution. A GDX file or GAMS point file from the previous run must be available, with matching Milestone years; otherwise, a compiler error is issued.",
  "TIMESTEP": "The purpose of the TIMESTEP option is to run the model in a stepwise manner with increasing model horizon and limited foresight. The TIMESTEP control variable specifies the number of years that should be optimized in each solution step. The total model horizon will be solved by successive steps, so that in each step the periods to be optimized are advanced further in the future, and all periods before them are fixed to the solution of the previous step. The amount of overlapping years between successive steps is by default half of the active step length (the value of TIMESTEP).",
  "ABS": "Option to use the Ancillary Balancing Services extension. ",
  "CLI": "The climate module estimates change in CO2 concentrations in the atmosphere, the upper ocean including the biosphere and the lower ocean, and calculates the change in radiative forcing and the induced change in global mean surface temperature.",
  "DSC": "Option to use lumpy investment formulation. Since the usage of the discrete investment options leads to a Mixed-Integer Programming (MIP) problem, the solve statement in the file solve.mod is automatically altered by the user shell.",
  "DUC": "Option to use the discrete unit commitment formulation.",
  "ETL": "Option to use endogenous technology learning formulation. Since the usage of this option leads to a Mixed-Integer Programming (MIP) problem, the solve statement in the file solve.mod is automatically altered by TIMES.",
  "MICRO": "Option to use the non-linear elastic demand formulation.",
  "RETIRE": "The RETIRE control variable can be used for enabling early and lumpy retirements of process capacities. The valid switch values for this control variable are: NO – Disables all early and lumpy retirements; LP – Enables continuous early retirements for all those processes that are included in the set PRC_RCAP(r,p); MIP – Enables early retirements for the processes that are included in the set PRC_RCAP(r,p), and additionally enables the retirements to be lumpy for those of these processes that also have RCAP_BLK (the lumpy block size) defined, and YES – Enables early retirements for any processes that have at least one instance of the parameter RCAP_BND defined. In this variant, activating lumpy retirements for those processes that have also RCAP_BLK defined requires that the setting DSC YES is used as well. Consequently, when using the RETIRE YES switch, using the set PRC_RCAP is not needed at all (and it will have no effect).",
  "VDA": "The VDA control variable can be used to enable the VDA pre-processor extension of TIMES.",
  "REDUCE": "Turn on/off the reduction. This environment variable controls in each equation where the flow variable occurs whether it should be replaced by some other term or not. If the control variable is not defined at all, the default is to make partial model reduction by eliminating unnecessary capacity variables and substituting emission flows only. ",
  "SPOINT": "GAMS control variable that can be used for the savepoint features in TIMES models.",
  "LPOINT": "GAMS control variable that can be used for the loadpoint features in TIMES models",
  "DEBUG": "By using the DEBUG control, the user can request dumping out all user/system data structures into a file, and turn on extended quality assurance checks.",
  "DUMPSOL": "Dump out selected solution results into a text file (levels and marginals of VAR_NCAP, VAR_CAP, VAR_ACT, VAR_FLO, VAR_IRE, VAR_SIN, VAR_SOUT, VAR_COMPRD, EQG_COMBAL, EQE_COMBAL, EQE_COMPRD).",
  "SOLVE_NOW": "If not activated, only check the input data and compile the source code, but do not solve the model.",
  "XTQA": "Turn on extended quality assurance checks.",
  "ANNCOST": "Until TIMES v3.4.9, the values reported for each of these cost components have been calculated strictly for the associated Milestone year of a period. However, this can result in investments made in other years within a period not being reflected, and for longer periods may not properly reflect changes in the other annual expenditures over that timeframe. A consequence of this is that it has not been possible to reconstruct the objective function value from the annualized costs reported. Additionally, these reported costs cannot be thought of as “representative” of the entire period, but only of the Milestone year. To redress this, from TIMES v3.5.0, the annual costs based upon the levelized costs over process lifetimes or periods can be requested. The various annualized cost report parameters are found in Table 9. In this way, all expenditures during the period are captured, and the total objective function can be reconstructed from the levelized annual costs with very high accuracy (when using OBLONG YES). There is also a new attribute Time_NPV, which gives the period-wise discount factors, and a UC tag = LEVCOST/COST indicating whether the annual costs reported for each scenario are levelized or not. That is, when said Attribute = LEVCOST for a scenario, then the annualized costs for said scenario represent the levelized average annual values.",
  "BENCOST": "TIMES includes also a basic benefit-cost reporting for new technologies.",
  "RPT_FLOTS": "Used for controlling the timeslices that will be used for reporting the levels of the TIMES flow variables. By default, the timeslices of the original TIMES flow variables are used also for reporting. However, in many cases it may be more desirable to have all the flow levels reported at the commodity timeslices (COM), or, for very large models, at the ANNUAL timeslice only. The RPT_FLOTS setting has no effect on the reporting of marginal costs for flows.",
  "SOLANS": "Produce the solution reports that can be imported into the ANSWER.",
  "SOLVEDA": "Prepare the solution reporting values that are to be imported into the VEDA-BE.",
  "BOTIME": "Can be used for adjusting the total available time span of years available in the model. All years related to the data and model must lie between BOTIME and EOTIME, inclusive. The default for BOTIME (‘Beginning of Time’) is 1850 and the default for EOTIME (‘End of Time’) is 2200.",
  "EOTIME": "Can be used for adjusting the total available time span of years available in the model. All years related to the data and model must lie between BOTIME and EOTIME, inclusive. The default for BOTIME (‘Beginning of Time’) is 1850 and the default for EOTIME (‘End of Time’) is 2200.",
  "DATAGDX": "This control can be used for requesting all the model input data to be dumped into a GDX file named <RUN_NAME~Data_yymmdd>.GDX",
  "DYNTS": "This control can be used for enabling dynamic timeslice configurations. Dynamic timeslices means that the timeslice tree can be varied according to model period.",
  "GDX_IREBND": "These control flags can be used to import bounds and rices on exogenous imports/exports from a previous run, and thereby override any user-defined bounds/prices. Only bounds and prices for such imports and exports flows are imported that were endogenous in the previous run but are exogenous for the current run. Tells TIMES to import the flow-levels of imports and exports from the file ‘boundfile.gdx’, and use these levels as fixed bounds on the imports and exports in the current run",
  "GDX_IPRIC": "These control flags can be used to import bounds and rices on exogenous imports/exports from a previous run, and thereby override any user-defined bounds/prices. Only bounds and prices for such imports and exports flows are imported that were endogenous in the previous run but are exogenous for the current run. Tells TIMES to import the marginal prices of imports and exports from the file ‘pricefile.gdx’, and define these prices on the imports and exports in the current run",
  "RELAX_PRC_CG": "Used to relax the requirement that all genuine commodity groups that are used in process-related attributes have to be explicitly associated with the processes, using the set PRC_CG. All PRC_CG definitions can be omitted in the model when the setting is enabled.",
  "RPOINT": "Used for reproducing the solution of a previous run, without actually solving the model at all. It should be used together with the LPOINT control, which specifies the GDX file where the previous solution is retrieved. The model generator then only loads the solution and generates the reports.",
  "SHELL": "Indicates the ANSWER-TIMES user shell is being used for running this TIMES models.",
  "VALIDATE": "A greatly simplified formulation of the objective function and capacity constraints, emulating the MARKAL model generator, may be requested – however, use of the VALIDATE control switch is discouraged.",
  "VAR_UC": "Used to enable or disable the explicit use of slack variables in user constraints. By default, no explicit slack variables are used and all the user constraints are either equalities or inequalities, depending on the bound type specified. However, if the slack variables are enabled, all the user constraints are defined as equality constraints, using bounds on the slack variables to define the actual type of the constraint. This can be useful for e.g. more efficient specification of ranges, and is required when using the stochastic or sensitivity modes.",
  "VINTOPT": "Any technology characteristics defined for a vintaged process describe the characteristics of new capacity installed in the year specified. However, in TIMES the characteristics at the Milestone year are by default used for all the capacity installed in the corresponding period, which can lead to accelerated technology development, depending on the lengths of periods. To avoid such distortions caused merely by period length definitions setting VINTOPT 1 is used, all vintaged characteristics of technologies are automatically adjusted so that the average characteristics of new capacity installed for each period correspond to the original data. When the setting VINTOPT 2 is used, all vintaged processes are modeled using a different approach, which preserves the average characteristics of new capacity installed for each period, as originally defined by the TIMES attributes. The VINTOPT control variable is currently for experimental use only.",
  "WAVER": "Usually the TIMES model generator interpolates the user-defined time-series data only for the Milestone years, and then uses the value at the Milestone year as a representative value for the whole period. An important exception to this common rule are the cost parameters, which are all interpolated densely, and are thus always fully taken into account. However, in some cases it might be desirable to have some other parameters densely interpolated, such that the calculated weighted average over each projection period would be used as the representative value for the period, instead of the value at the Milestone year. Perhaps the most suitable candidates for applying this kind of an interpolation method are parameters representing projected absolute values, such as demands or remaining residual capacities. There is a switch for activating the Weighted Average Interpolation method described above, to be applied for the demand projections (COM_PROJ) and residual capacities (PRC_RESID), as well as the NCAP_PASTI parameters reflecting the available capacity of the installation period.",
  "STARTRUN": "No description available",
  "DSCAUTO": "No description available"
}
